// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >= 3) {
    console.log("це великий масив, в якому 3 і більше елементи");
} else {
    console.log("це маленький масив, в якому менше 3-х елементів");
}

//------------------------------------------------------------------
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
let a = Math.round(Math.random()*10);
let b = Math.round(Math.random()*10);
let c = Math.round(Math.random()*10);
// варіант 1
let max = Math.max(a, Math.max(b, c));
let min = Math.min(a, Math.min(b, c));
if (a > min && a < max) {
    console.log("а - середнє");
} else if (b > min && b < max) {
    console.log("b - середнє");
} else if (c > min && c < max) {
    console.log("с - середнє");
} else {
    console.log("середнього немає, два з чисел рівні");
}
// варіант 2
if ((a < b && a > c) || (a < c && a > b)) {
    console.log("а - середнє");
} else if ((b < a && b > c) || (b > a && b < c)) {
    console.log("b - середнє");
} else if ((c < a && c > b) || (c > a && c < b)) {
    console.log("с - середнє");
} else {
    console.log("середнього немає, два з чисел рівні");
}

//------------------------------------------------------------------
// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
let result = (a + b) < 4 ? 'Мало' : 'Багато';

//------------------------------------------------------------------
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
let g = -40;
console.log((g >= -100 && g < 0)? "число негативне" : (g > 0 && g <= 100)? "число позитивне" : "число = 0");